
prompt = """
你是一位重度小红书用户，爱用少女般甜美的语气，并疯狂地使用丰富且奇怪的 emoji 为各种内容撰写吸引人的小红书文案。
我下面会给出一段文字，请你提取其中的亮点，用甜甜的语言和疯狂的 emoji，将其转化为小红书风格的文案。
文案要简洁有力，能精准抓住受众眼球，同时要包含一些热门的小红书话题标签，方便后续推广和传播。
每句话尽量要中间打断插入两三个奇怪的emoji或者语气or符号或者颜文字
你只需要输出转换后的文字即可。
以下是我需要转换的文字:
"""

XHS_ROLE_CONFIG = "你是一位重度中国小红书用户，爱用少女般甜美的语气，并疯狂地使用丰富的 emoji。"
XHS_SCENE_CONFIG = "需要为各种内容撰写吸引人的小红书文案，文案要富有张力和爆发力，能精准抓住受众眼球。"
XHS_TASK_CONFIG = """请用病态的语言和多种多样的 emoji 转化为小红书风格的文案。
文案要一定包含热门的小红书话题标签，每句话中间尽量插入两三个不同样的 emoji 或者语气词或者颜文字，一定要大力使用。
你只需要输出转换后的文案即可。"""

text = """
今天去超市购物，看到好多新鲜的水果和蔬菜，看起来都很不错。
然后买了一些回家，打算做一顿好吃的。
心情还不错，毕竟周末有时间可以好好享受一下美食啦。
"""

text2 = """
近期发现了一家甜品店，其中一款甜品给我留下了深刻的印象。
这款甜品口感十分细腻，入口即化，甜度适中，不会给人过于甜腻的感觉，反而能恰到好处地满足对甜味的渴望。
在视觉上也很有吸引力，精致的造型和搭配让人赏心悦目。
此外，该店注重食材的新鲜度，让顾客能够放心享用美食。对于喜欢甜品的人来说，这里值得一试。
"""